In [17]:
import numpy as np
import pandas as pd

In [19]:
df = pd.DataFrame(
    np.random.randn(5, 3),
    index=["a", "c", "e", "f", "h"],
    columns=["one", "two", "three"],
)

df['four'] = 'bar'
df['five'] = df['one'] > 0

df = df.reindex(["a", "b", "c", "d", "e", "f", "g", "h"])
df

        one       two     three four   five
a -1.017264 -0.936980  1.195106  bar  False
b       NaN       NaN       NaN  NaN    NaN
c -0.762949 -1.135722  1.710865  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.275817  1.640763  1.621143  bar   True
f  1.757227  0.360455 -0.451869  bar   True
g       NaN       NaN       NaN  NaN    NaN
h  0.370913  1.841783  0.867275  bar   True

In [25]:
# 1. 判断是否有空值
np.any(df.isna())

np.all(df.notna())
# df.info()

False

In [4]:
# 2. 填充NAN
df['two'].fillna(0)

a    0.364397
b    0.000000
c   -0.255192
d    0.000000
e    0.032852
f   -0.214429
g    0.000000
h    0.943905
Name: two, dtype: float64

In [5]:
df['two'].fillna(df['two'].mean())

a    0.364397
b    0.174306
c   -0.255192
d    0.174306
e    0.032852
f   -0.214429
g    0.174306
h    0.943905
Name: two, dtype: float64

In [6]:
# 3. 删除NAN
df.dropna(axis=0)

        one       two     three four   five
a -0.438646  0.364397  1.831542  bar  False
c  1.976154 -0.255192  0.299760  bar   True
e -1.053312  0.032852 -1.627264  bar  False
f -0.738551 -0.214429 -0.013392  bar  False
h -0.769934  0.943905 -0.233727  bar  False

In [7]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g, h]

In [8]:
# 4. 替换
d = {"a": list(range(4)), "b": list("ab.."), "c": ["a", "b", np.nan, "d"]}
df = pd.DataFrame(d)
df

   a  b    c
0  0  a    a
1  1  b    b
2  2  .  NaN
3  3  .    d

In [9]:
# df.replace(".", np.NAN)
df.replace(np.NAN, "0")

   a  b  c
0  0  a  a
1  1  b  b
2  2  .  0
3  3  .  d

In [5]:
import numpy as np
import pandas as pd
df_obj = pd.DataFrame({'data1' : ['a'] * 4 + ['b'] * 4,'data2' : np.random.randint(0, 4, 8)})
df_obj

  data1  data2
0     a      1
1     a      0
2     a      0
3     a      1
4     b      1
5     b      1
6     b      3
7     b      3

In [6]:
df_obj.duplicated()

0    False
1    False
2     True
3     True
4    False
5     True
6    False
7     True
dtype: bool

In [7]:
df_obj.drop_duplicates()

  data1  data2
0     a      1
1     a      0
4     b      1
6     b      3

In [8]:
df_obj.drop_duplicates('data2')

  data1  data2
0     a      1
1     a      0
6     b      3

In [10]:
df_obj = pd.DataFrame({'data1' : ['a'] * 4 + ['b'] * 4,'data2' : np.random.randint(0, 4, 8)})
df_obj

  data1  data2
0     a      3
1     a      1
2     a      3
3     a      2
4     b      1
5     b      0
6     b      3
7     b      0

In [11]:
ser_obj = pd.Series(np.random.randint(0,10,10))
ser_obj

0    5
1    7
2    0
3    7
4    5
5    5
6    5
7    8
8    5
9    7
dtype: int32

In [13]:
# 单个值替换单个值
ser_obj.replace(0, -100)

0      5
1      7
2   -100
3      7
4      5
5      5
6      5
7      8
8      5
9      7
dtype: int32

In [15]:
print(ser_obj.replace([6, 8], -100))

0   -100
1      7
2      0
3      7
4   -100
5   -100
6   -100
7   -100
8   -100
9      7
dtype: int64

In [16]:
print(ser_obj.replace([5, 7], [-100, -200]))

0   -100
1   -200
2      0
3   -200
4   -100
5   -100
6   -100
7      8
8   -100
9   -200
dtype: int64